app/Controllers/Admin/Product.php

  public function index()
  {
    return view('admin/product', [
      'title'        => 'Products',
      'products' => $this->product->findAll()
---
SELECT *
FROM `products`