app/Controllers/Admin/Transaction.php

  public function index()
  {
    return view('admin/transaction', [
      'title'        => 'Transactions',
      'transactions' => $this->transaction->join('users', 'transactions.id_user=users.id')->select('transactions.id, users.name, transactions.status')->findAll()
---
SELECT `transactions`.`id`, `users`.`name`, `transactions`.`status`
FROM `transactions`
JOIN `users` ON `transactions`.`id_user`=`users`.`id`