app/Controllers/User/Cart.php

  public function remove($id)
  {
    $this->cart->delete($id);
---
DELETE FROM `carts`
WHERE `id` IN ('2')

  public function add($id)
  {
    $product = $this->product->find($id);

    $this->cart->insert([
      'id_product' => $product['id'],
      'id_user' => session()->get('id')
    ]);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '1'
INSERT INTO `carts` (`id_product`, `id_user`) VALUES ('1', '1')