app/Controllers/User/Product.php

SELECT *
FROM `products`
---
  public function index()
  {
    return view('user/product', [
      'title'        => 'Products',
      'products' => $this->product->findAll()