app/Controllers/User/Transaction.php

  public function detail($id)
  {
    // $transaction =

    return view('user/transaction', [
      'title' => 'Transaction detail',
      'transaction' => $this->transaction->find($id),
      'carts' => $this->cart->findByUser(session()->get())
    ]);
---
SELECT *
FROM `transactions`
WHERE `transactions`.`id` = '6'

  public function checkout()
  {
    $transactionID = $this->transaction->insert([
      'id_user' => session()->get('id'),
      'status'  => 'pending'
    ],  true);
---
INSERT INTO `transactions` (`id_user`, `status`) VALUES ('1', 'pending')