app/Models/CartModel.php

  public function findByUser($id)
  {
    return $this->where('id_user', $id)->join('products', 'carts.id_product=products.id')->select('carts.id, title, id_product, description, price, thumbnail')->findAll();
---
SELECT `carts`.`id`, `title`, `id_product`, `description`, `price`, `thumbnail`
FROM `carts`
JOIN `products` ON `carts`.`id_product`=`products`.`id`
WHERE `id_user` = '1'