app/Models/TransactionModel.php

SELECT *
FROM `transactions`
WHERE `id_user` = '1'
---
  public function findByUser($id)
  {
    return $this->where('id_user', $id)->findAll();